modm-ext/data.modm.io/docs/svd/header_stm32l071xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP12_COMMON</name>
      <groupName>COMP_Common</groupName>
      <alternatePeripheral>COMP1</alternatePeripheral>
      <baseAddress>0x40010018</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register, used for bits common to several COMP instances</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMP1EN</name>
              <description>COMP1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2SPEED</name>
              <description>COMP2 power mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEDIUMSPEED</name>
                  <description>COMP power mode to fast speed (specific to COMP instance: COMP2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULTRALOWPOWER</name>
                  <description>COMP power mode to low speed (specific to COMP instance: COMP2)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1INNSEL</name>
              <description>COMP1 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
            <field>
              <name>COMP1WM</name>
              <description>Comparators window mode enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLE</name>
                  <description>Window mode disable: Comparators 1 and 2 are independent</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>COMP1_INPUT_PLUS_COMMON</name>
                  <description>Window mode enable: Comparators instances pair COMP1 and COMP2 have their input plus connected together. The common input is COMP1 input plus (COMP2 input plus is no more accessible).</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1LPTIM1IN1</name>
              <description>COMP1 LPTIM1 IN1 connection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2LPTIM1IN1</name>
              <description>COMP2 LPTIM1 IN1 connection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1POLARITY</name>
              <description>COMP1 output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1VALUE</name>
              <description>COMP1 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1LOCK</name>
              <description>COMP1 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR_ALT</name>
          <description>COMP control and status register, used for bits common to several COMP instances</description>
          <alternateRegister>CSR</alternateRegister>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMP1EN</name>
              <description>COMP1 enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2SPEED</name>
              <description>COMP2 power mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MEDIUMSPEED</name>
                  <description>COMP power mode to fast speed (specific to COMP instance: COMP2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ULTRALOWPOWER</name>
                  <description>COMP power mode to low speed (specific to COMP instance: COMP2)</description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP2INNSEL</name>
              <description>COMP2 inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VREFINT</name>
                  <description>Comparator input minus connected to VrefInt (specifity of COMP2 related to path to enable via SYSCFG: refer to comment in function @ref LL_COMP_SetInputMinus() )</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input minus connected to IO1 (pin PA0 for COMP1, pin PA2 for COMP2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC1_CH1</name>
                  <description>Comparator input minus connected to DAC1 channel 1 (DAC_OUT1)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DAC1_CH2</name>
                  <description>Comparator input minus connected to DAC1 channel 2 (DAC_OUT2)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_1_4VREFINT</name>
                  <description>Comparator input minus connected to 1/4 VrefInt (specifity of COMP2 related to path to enable via SYSCFG: refer to comment in function @ref LL_COMP_SetInputMinus() ) (specific to COMP instance: COMP2)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_1_2VREFINT</name>
                  <description>Comparator input minus connected to 1/2 VrefInt (specifity of COMP2 related to path to enable via SYSCFG: refer to comment in function @ref LL_COMP_SetInputMinus() ) (specific to COMP instance: COMP2)</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MINUS_3_4VREFINT</name>
                  <description>Comparator input minus connected to 3/4 VrefInt (specifity of COMP2 related to path to enable via SYSCFG: refer to comment in function @ref LL_COMP_SetInputMinus() ) (specific to COMP instance: COMP2)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO2</name>
                  <description>Comparator input minus connected to IO2 (pin PB3 for COMP2) (specific to COMP instance: COMP2)</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP2INPSEL</name>
              <description>COMPx non inverting input select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IO1</name>
                  <description>Comparator input plus connected to IO1 (pin PA1 for COMP1, pin PA3 for COMP2)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO2</name>
                  <description>Comparator input plus connected to IO2 (pin PB4 for COMP2) (specific to COMP instance: COMP2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO3</name>
                  <description>Comparator input plus connected to IO3 (pin PA5 for COMP2) (specific to COMP instance: COMP2)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO4</name>
                  <description>Comparator input plus connected to IO4 (pin PB6 for COMP2) (specific to COMP instance: COMP2)</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IO5</name>
                  <description>Comparator input plus connected to IO5 (pin PB7 for COMP2) (specific to COMP instance: COMP2)</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMP1LPTIM1IN1</name>
              <description>COMP1 LPTIM1 IN1 connection</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP2LPTIM1IN1</name>
              <description>COMP2 LPTIM1 IN1 connection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1POLARITY</name>
              <description>COMP1 output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1VALUE</name>
              <description>COMP1 output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMP1LOCK</name>
              <description>COMP1 lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
